___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
data["Person"].count("Charlie")

1

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [9]:
df.groupby('Company')

You can save this object as a new variable:

In [16]:
by_comp = df.groupby("Company")["Sales"]

And then call aggregate methods off the object:

In [17]:
by_comp.sum()

Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64

More examples of aggregate methods:

In [18]:
by_comp.std()

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

In [19]:
by_comp.min()

Company
FB      243
GOOG    120
MSFT    124
Name: Sales, dtype: int64

In [20]:
by_comp.max()

Company
FB      350
GOOG    200
MSFT    340
Name: Sales, dtype: int64

In [21]:
by_comp.count()

Company
FB      2
GOOG    2
MSFT    2
Name: Sales, dtype: int64

In [22]:
by_comp.describe()

         count   mean         std    min     25%    50%     75%    max
Company
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [23]:
by_comp.describe().transpose()

Company          FB        GOOG        MSFT
count      2.000000    2.000000    2.000000
mean     296.500000  160.000000  232.000000
std       75.660426   56.568542  152.735065
min      243.000000  120.000000  124.000000
25%      269.750000  140.000000  178.000000
50%      296.500000  160.000000  232.000000
75%      323.250000  180.000000  286.000000
max      350.000000  200.000000  340.000000

In [24]:
by_comp.describe().transpose()['GOOG']

count      2.000000
mean     160.000000
std       56.568542
min      120.000000
25%      140.000000
50%      160.000000
75%      180.000000
max      200.000000
Name: GOOG, dtype: float64

# Great Job!